saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/NXP.MIMXRT1021_DFP.11.0.0.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="aipstz" Cversion="2.0.0" condition="device.MIMXRT1021_AND_driver.common">
      <description>aipstz Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_aipstz.c"/>
        <file category="header" name="drivers/fsl_aipstz.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="adc_etc" Cversion="2.0.1" condition="device.MIMXRT1021_AND_driver.common">
      <description>ADC_ETC Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_adc_etc.c"/>
        <file category="header" name="drivers/fsl_adc_etc.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="adc_12b1msps_sar" Cversion="2.0.1" condition="device.MIMXRT1021_AND_driver.common">
      <description>ADC Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_adc.c"/>
        <file category="header" name="drivers/fsl_adc.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="common" Cversion="2.0.1" condition="device.MIMXRT1021_AND_device.MIMXRT1021_CMSIS_AND_driver.clock">
      <description>COMMON Driver</description>
      <files>
        <file category="header" name="drivers/fsl_common.h"/>
        <file category="sourceC" name="drivers/fsl_common.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="clock" Cversion="2.1.0" condition="device.MIMXRT1021_AND_driver.common">
      <description>Clock Driver</description>
      <files>
        <file category="header" name="drivers/fsl_clock.h"/>
        <file category="sourceC" name="drivers/fsl_clock.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="xip_device" Cversion="2.0.0" condition="device.MIMXRT1021">
      <description>XIP Device Driver</description>
      <RTE_Components_h>
#define XIP_EXTERNAL_FLASH 1
#define XIP_BOOT_HEADER_ENABLE 1
</RTE_Components_h>
      <files>
        <file category="header" name="xip/fsl_flexspi_nor_boot.h"/>
        <file category="sourceC" name="xip/fsl_flexspi_nor_boot.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8960" Cversion="1.0.0" condition="device.MIMXRT1021">
      <description/>
      <files>
        <file category="header" name="components/codec/wm8960/fsl_wm8960.h"/>
        <file category="sourceC" name="components/codec/wm8960/fsl_wm8960.c"/>
        <file category="header" name="components/codec/fsl_codec_common.h"/>
        <file category="sourceC" name="components/codec/fsl_codec_common.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="phyksz8081" Cversion="1.0.0" condition="device.MIMXRT1021">
      <description/>
      <files>
        <file category="header" name="components/phyksz8081/fsl_phy.h"/>
        <file category="sourceC" name="components/phyksz8081/fsl_phy.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="fxos8700cq" Cversion="1.0.0" condition="device.MIMXRT1021">
      <description/>
      <files>
        <file category="header" name="components/fxos8700cq/fsl_fxos.h"/>
        <file category="sourceC" name="components/fxos8700cq/fsl_fxos.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USART" Csub="lpuart_cmsis_edma" Cversion="2.0.1" condition="device.MIMXRT1021_AND_CMSIS_Driver_Include.USART_AND_RTE_Device_AND_driver.lpuart_edma">
      <description>LPUART CMSIS Driver</description>
      <files>
        <file category="header" name="cmsis_drivers/fsl_lpuart_cmsis.h"/>
        <file category="sourceC" name="cmsis_drivers/fsl_lpuart_cmsis.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="SPI" Csub="lpspi_cmsis" Cversion="2.0.0" condition="device.MIMXRT1021_AND_CMSIS_Driver_Include.SPI_AND_RTE_Device_AND_driver.lpspi_edma">
      <description>LPSPI CMSIS Driver</description>
      <files>
        <file category="header" name="cmsis_drivers/fsl_lpspi_cmsis.h"/>
        <file category="sourceC" name="cmsis_drivers/fsl_lpspi_cmsis.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="I2C" Csub="lpi2c_cmsis" Cversion="2.0.0" condition="device.MIMXRT1021_AND_CMSIS_Driver_Include.I2C_AND_RTE_Device_AND_driver.lpi2c_edma">
      <description>LPI2C CMSIS Driver</description>
      <files>
        <file category="header" name="cmsis_drivers/fsl_lpi2c_cmsis.h"/>
        <file category="sourceC" name="cmsis_drivers/fsl_lpi2c_cmsis.c"/>
      </files>
    </component>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="MIMXRT1021" Cversion="1.0.0" condition="device.MIMXRT1021_AND_component.lpuart_adapter_AND_component.serial_manager_uart_AND_component.serial_manager_uart_AND_device.MIMXRT1021_startup_AND_driver.clock_AND_driver.common_AND_driver.igpio_AND_driver.iomuxc_AND_driver.lpuart_AND_utility.debug_console_AND_utility.debug_console" isDefaultVariant="1">
      <description/>
      <files>
        <file category="header" attr="config" name="project_template/board.h"/>
        <file category="sourceC" attr="config" name="project_template/board.c"/>
        <file category="header" attr="config" name="project_template/clock_config.h"/>
        <file category="sourceC" attr="config" name="project_template/clock_config.c"/>
        <file category="header" attr="config" name="project_template/pin_mux.h"/>
        <file category="sourceC" attr="config" name="project_template/pin_mux.c"/>
        <file category="header" attr="config" name="project_template/peripherals.h"/>
        <file category="sourceC" attr="config" name="project_template/peripherals.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Csub="MIMXRT1021_startup" Cversion="1.0.0" condition="device.MIMXRT1021_AND_CMSIS_Include_core_cm7">
      <description/>
      <files>
        <file condition="iar" category="sourceAsm" attr="config" name="iar/startup_MIMXRT1021.s"/>
        <file condition="mdk" category="sourceAsm" attr="config" name="arm/startup_MIMXRT1021.s"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MIMXRT1021xxxxx_flexspi_nor.scf"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MIMXRT1021xxxxx_flexspi_nor_sdram.scf"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MIMXRT1021xxxxx_ram.scf"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MIMXRT1021xxxxx_sdram.scf"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MIMXRT1021xxxxx_sdram_txt.scf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MIMXRT1021xxxxx_flexspi_nor.icf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MIMXRT1021xxxxx_flexspi_nor_sdram.icf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MIMXRT1021xxxxx_ram.icf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MIMXRT1021xxxxx_sdram.icf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MIMXRT1021xxxxx_sdram_txt.icf"/>
        <file category="header" attr="config" name="fsl_device_registers.h"/>
        <file category="header" attr="config" name="MIMXRT1021.h"/>
        <file category="header" attr="config" name="MIMXRT1021_features.h"/>
        <file category="sourceC" attr="config" name="system_MIMXRT1021.c"/>
        <file category="header" attr="config" name="system_MIMXRT1021.h"/>
      </files>
    </component>
  </components>
</package>
